Repository: linqining/biuz
Catalog: ios/ZCodeMobileApp/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

source: // 与发起值一致 ✓
en: // Consistent with sent value ✓

source: // 或 authCode，双兼容
en: // or authCode, dual-compatible

source: · ⚠ 桌面版本与配对链接不一致
en: · ⚠ desktop version differs from pairing link

source: · 凭据已配置
en: · credential configured

source: · 未配置凭据
en: · no credential

source: - TextField("发送消息", text: $draft)
en: - TextField(\"Send a message\", text: $draft)

source: - 主色 #21c17a
en: - primary #21c17a

source: - 主色 #32f08c（对比度 12.7:1）
en: - primary #32f08c (contrast 12.7:1)

source: - 深字 #04120a 用于绿底前景
en: - deep text #04120a for on-green foreground

source: - 状态三色：Running / Waiting / Completed
en: - status triad: Running / Waiting / Completed

source: --no-token · authRequired=false · 不校验令牌
en: --no-token · authRequired=false · token not verified

source: , delay))s 后
en: , delay))s later

source: ，%lld 条未处理
en: , %lld pending items

source: ，请开始。
en: , please start.

source: （思考）%@
en: (thinking) %@

source: （无提交说明）
en: (no commit message)

source: （空）
en: (empty)

source: ) · 后续请求 401 → 引导重登
en: ) · subsequent 401 → re-login prompt

source: ) 失败
en: ) failed

source: {origin}/login · BigModel 智能体平台
en: {origin}/login · BigModel agent platform

source: 《%@》读取失败，已跳过
en: Couldn't read %@, skipped

source: 《用户协议》
en: Terms of Service

source: 《隐私政策》
en: Privacy Policy

source: @@ -4,6 +4,8 @@ # ZCode 设计规范
en: @@ -4,6 +4,8 @@ # ZCode design spec

source: @%@ · Coding Plan · 剩余额度（演示）
en: %@ · Coding Plan · Remaining quota (demo)

source: ## 设计令牌
en: ## Design tokens

# %@ · %@ · workspaces[%lld]
source: %1$@ · %2$@ · workspaces[%3$lld]
en: %@ · %@ · workspaces[%lld]

source: %@ · 创建于 %@
en: %@ · created %@

source: %@ 前有效
en: Valid until %@

source: %@ 已完成
en: %@ completed

source: %@ 执行失败
en: %@ failed

source: %@ 有操作待审批
en: %@ needs your approval

source: %@ 重置
en: %@ reset

source: %@的移动端读面尚未接入；为避免误导，连接态不再展示示例数据。请在桌面端查看，或稍后版本更新后同步。
en: Mobile view for %@ is not available yet; to avoid confusion, sample data is hidden while connected. Check the desktop app, or sync after a later update.

source: %lld 个
en: %lld items

# %lld 个任务进行中 · %lld 个待操作
source: %1$lld 个任务进行中 · %2$lld 个待操作
en: %lld tasks running · %lld awaiting action

source: %lld 个文件
en: %lld files

source: %lld 个记忆文件 · 更新于 %@
en: %lld memory files · updated %@

source: %lld 分钟
en: %lld min

# %lld 台已配对 · %lld 台在线
source: %1$lld 台已配对 · %2$lld 台在线
en: %lld paired · %lld online

source: %lld 处命中
en: %lld matches

source: %lld 字
en: %lld chars

# %lld 小时 %lld 分钟
source: %1$lld 小时 %2$lld 分钟
en: %lldh %lldm

source: %lld 次
en: %lld calls

source: %lld 重置
en: %lld resets

source: + .font(T.font(16)) // iOS 聚焦防缩放
en: + .font(T.font(16)) // iOS focus zoom-out guard

source: + TextField("发送消息", text: $draft, axis: .vertical)
en: + TextField(\"Send a message\", text: $draft, axis: .vertical)

source: +%lld 条工作流
en: +%lld more workflows

source: ✕ / 下拉 / 页内取消 → 未产生 code → 重新登录
en: ✕ / swipe down / in-page cancel → no code produced → sign in again

source: 2 台在线
en: 2 online

source: 4 个服务器已连接
en: 4 servers connected

source: 5 小时
en: 5-hour

source: 5 小时卡
en: 5-hour reset card

source: 8 分 24 秒
en: 8m 24s

source: 12 项已启用
en: 12 enabled

source: 12.4M（日均 413K）
en: 12.4M (413K daily avg)

source: 30s 无 pair_status_ack · 判定 stale → 重连
en: No pair_status_ack in 30s · stale → reconnect

source: 45s 未收到 rpc-frame-ack · 通道 degraded
en: No rpc-frame-ack in 45s · channel degraded

source: 128 条
en: 128 entries

source: 401 · 令牌不匹配
en: 401 · token mismatch

source: 2026-09-20 更新
en: Updated 2026-09-20

source: 2026-09-25 更新
en: Updated 2026-09-25

source: 2026-09-28 更新
en: Updated 2026-09-28

source: Agent 能力
en: Agent capabilities

source: Agent 长期记忆条目
en: Agent long-term memory entries

source: Agent: 已定位到网关 504，准备重试策略。
en: Agent: gateway 504 identified, preparing retry strategy.

source: Agent: 梳理出 14 个待迁移端点，其中 3 个破坏性变更。
en: Agent: 14 endpoints to migrate, 3 breaking changes.

source: Agent: 长列表改懒加载，帧率 42 → 58fps。
en: Agent: long list moved to lazy loading, 42 → 58fps.

source: AI 编程智能体 · 移动工作台
en: AI coding agent · mobile workbench

source: API v3 迁移评估
en: API v3 migration review

source: API 翻译
en: API translation

source: app 响应无匹配 requestId（忽略）
en: app response without matching requestId (ignored)

source: App 用量（近 30 天）
en: App usage (last 30 days)

source: App 用量分布：桌面端未提供（getAppUsageStats 不可用）
en: App usage breakdown: not provided by desktop (getAppUsageStats unavailable)

source: authRequired=false · --no-token（免鉴权）
en: authRequired=false · --no-token (no auth)

source: BigModel · 其他登录方式
en: BigModel · alternative sign-in

source: BiuZ · 为 ZCode 社区版桌面端打造的移动遥控台
en: BiuZ · mobile remote console for the ZCode community desktop

source: BiuZ for iOS · 已连接桌面端 · 指令经桌面端执行，文件保持只读
en: BiuZ for iOS · desktop connected · commands run on desktop, files stay read-only

source: BiuZ for iOS · 演示数据由本地 Mock 提供
en: BiuZ for iOS · demo data provided by local mock

source: BiuZ 不提供应用内语言切换：界面语言随 iOS 系统语言自动切换（简体中文 / English）。需要更换语言时，请在系统「设置 → BiuZ → 语言」中选择（iOS 13+ 每应用语言设置），修改后重启应用生效。
en: BiuZ has no in-app language switch: the UI follows the iOS system language (Simplified Chinese / English). To change it, pick a language in Settings → BiuZ → Language (per-app language, iOS 13+), then relaunch.

source: bootstrap + workspace-bridge-open 完成 · 桥内 Initialize 已到
en: bootstrap + workspace-bridge-open done · in-bridge Initialize received

source: chat.z.ai · Z.ai 账号授权
en: chat.z.ai · Z.ai account authorization

source: chips = server-info.capabilities（仅展示）；clientHello 口径另源（握手 HelloMessage.capabilities 宣告键取子集）
en: chips = server-info.capabilities (display only); clientHello set sourced separately (subset of handshake HelloMessage.capabilities)

source: code 已提取 · error 参数未出现
en: code extracted · no error parameter

source: Coding Plan 额度
en: Coding Plan quota

source: data.token · zcode JWT · 已签发
en: data.token · zcode JWT · issued

source: DEVICE-OFFLINE · 宽限重连
en: DEVICE-OFFLINE · grace reconnect

source: expiresAt=%@ · 后续请求 401 → 引导重登
en: expiresAt=%@ · later requests return 401 → re-login prompted

source: GET /api/server-info · 1.5s 超时
en: GET /api/server-info · 1.5s timeout

source: hello 解析失败
en: hello parse failed

source: http://<LAN-IP>:3030/?token=… · 令牌随进程存活
en: http://<LAN-IP>:3030/?token=… · token lives with the process

source: IM Bot 由桌面端托管，连接后此处同步通道列表与运行状态
en: IM bots are managed by the desktop; connect to sync channels and runtime status

source: initializeConversationV4 · 握手完成
en: initializeConversationV4 · handshake complete

source: JSONFileStore 注入实现
en: Inject JSONFileStore implementation

source: K8s 助手
en: K8s assistant

source: Keychain · %@ · 401 时重扫
en: Keychain · %@ · rescan on 401

source: Keychain 写入失败
en: Keychain write failed

source: KEYCHAIN 写入失败
en: KEYCHAIN write failed

source: M 月 d 日 HH:mm
en: MMM d, HH:mm

source: MCP 服务器
en: MCP server

source: OAuth · tokenSet 仅存 Keychain
en: OAuth · tokenSet stored in Keychain only

source: POST /api/v1/oauth/token 超时或响应 code≠0 → 检查网络后重试
en: POST /api/v1/oauth/token timed out or returned code≠0 → check network and retry

source: read Sources/Core/SessionStore.swift (128 行)
en: read Sources/Core/SessionStore.swift (128 lines)

source: redirect 拦截 · 正在校验授权结果
en: redirect intercepted · verifying authorization result

source: replay 缓冲超限
en: replay buffer overflow

source: replay 缓冲超限（>8MB）· 通道 degraded
en: replay buffer overflow (>8MB) · channel degraded

source: resyncWorkspaceConfigV4 · 丢帧自愈已触发
en: resyncWorkspaceConfigV4 · frame-drop self-heal triggered

source: RPC 超时：%@.%@
en: RPC timeout: %@.%@

source: RPC 载荷超限（maxMessageBytes=16MB）
en: RPC payload too large (maxMessageBytes=16MB)

source: RPC 错误对象
en: RPC error object

source: rpc-frame 解析失败 · invalidPayload
en: rpc-frame parse failed · invalidPayload

source: rpc-frame 通道不可用
en: rpc-frame channel unavailable

source: server-info 已返回 · 正在建立会话
en: server-info received · establishing session

source: server-info 缺失
en: server-info missing

source: server-info 解析失败
en: server-info parse failed

source: server-info 返回的工作区列表为空。请在桌面端检查 --workspace / ZCODE_SERVER_WORKSPACE 配置后重试。
en: server-info returned an empty workspace list. Check --workspace / ZCODE_SERVER_WORKSPACE on the desktop and retry.

source: SQL 优化
en: SQL optimization

source: state 校验失败
en: state verification failed

source: state 校验通过 · 防伪一致
en: state verified · anti-forgery match

source: state 缺失或不匹配
en: state missing or mismatched

source: subscribeWorkspaceConfigV4 · workspace-config 订阅完成
en: subscribeWorkspaceConfigV4 · workspace-config subscribed

source: subscribeWorkspaceConfigV4 · 服务端未提供（chips 走缺省展示）
en: subscribeWorkspaceConfigV4 · not offered by server (chips fall back to defaults)

source: test-runner 运行中 · 回归 46 用例
en: test-runner running · 46 regression cases

# todo %lld/%lld
source: todo %1$lld/%2$lld
en: todo %lld/%lld

source: todo 1/4 · 45 分钟
en: todo 1/4 · 45 min

source: todo 3/5 · 12 分钟
en: todo 3/5 · 12 min

source: token 校验通过 · authRequired=true
en: token verified · authRequired=true

source: Token 用量
en: Token usage

source: tokenSet + userInfo · 仅存本机
en: tokenSet + userInfo · stored on device only

source: URL 键盘
en: URL keyboard

source: v2.4 新增
en: New in v2.4

source: waiting 30s 超时 · 桌面未确认配对
en: waiting timed out after 30s · pairing not confirmed by desktop

source: WEEK-40.md 已生成并同步。
en: WEEK-40.md generated and synced.

source: workspace-bridge-ready 缺 bridge 字段
en: workspace-bridge-ready missing bridge field

source: WS 已建立 · clientMode=web-remote-replayable
en: WS established · clientMode=web-remote-replayable

source: wss://（反向代理 TLS）
en: wss:// (reverse proxy TLS)

source: Z.ai 账号
en: Z.ai account

source: Z.ai 账号登录在应用内授权 Sheet 中完成，凭据仅存本机 Keychain
en: Z.ai sign-in completes in the in-app authorization sheet; credentials stay in the local Keychain

source: Zai 开发者
en: Zai Developer

source: zcode --web --host 0.0.0.0 · Core 版仅 loopback，须走 --web 分发
en: zcode --web --host 0.0.0.0 · Core build binds loopback only, use --web

source: 一键填充
en: Autofill

source: 一键领取
en: Claim now

source: 上下文
en: Context

source: 上下文·演示
en: Context · demo

source: 上次使用（5 小时窗）：%@
en: Last used (5-hour window): %@

source: 上次使用（周窗）：%@
en: Last used (weekly window): %@

source: 上次连接 ·
en: Last connected ·

source: 下午好
en: Good afternoon

source: 下行信封超限（envelopeTooLarge）
en: Downlink envelope too large (envelopeTooLarge)

source: 不可用
en: Unavailable

source: 不可达
en: Unreachable

source: 不在连接态，无法切换思考强度
en: Not connected; cannot switch thinking effort

source: 不在连接态，无法切换桌面端模型
en: Not connected — can't switch desktop model

source: 不指定（纯对话）
en: None (chat only)

source: 不绑定项目，产物以文件卡呈现
en: No project attached; artifacts appear as file cards

source: 与
en: and

source: 与发起值一致 · 防伪通过
en: Matches sent value · anti-forgery passed

source: 与桌面端的连接已断开
en: Desktop connection lost

source: 中
en: Medium

source: 中午好
en: Good afternoon

source: 中继 auth/bridge
en: relay auth/bridge

source: 中继 bootstrap 未提供 activeWorkspaceKey
en: relay bootstrap missing activeWorkspaceKey

source: 中继桥 hello 解析失败（降级继续）
en: relay bridge hello parse failed (continuing degraded)

source: 中继连接中断
en: Relay connection interrupted

source: 中继连接已关闭
en: Relay connection closed

source: 中继配置缺失
en: Relay config missing

source: 中继重连，请求已中断
en: Relay reconnecting, request aborted

source: 中继鉴权超时（auth 握手无响应）
en: Relay auth timeout (no auth handshake response)

source: 为会话列表增加搜索防抖与高亮
en: Add search debouncing and highlighting to the conversation list

source: 也可跳过登录直接连接局域网桌面端 · 登录即同意
en: You can also skip sign-in and connect a LAN desktop directly · Signing in means you accept the

source: 也可跳过登录直接连接局域网桌面端 · 登录即同意《用户协议》与《隐私政策》
en: You can skip sign-in and connect a LAN desktop directly · Signing in means you accept the Terms and Privacy Policy

source: 二次确认后清除 Keychain 令牌
en: Clear Keychain token after confirmation

source: 二进制文件暂不支持移动端分享，请在桌面端查看或分享
en: Binary files can't be shared from mobile yet; view or share them on the desktop

source: 云中继
en: Cloud relay

source: 云中继直连 wss · auth 握手与桥建立中
en: Relay direct wss · auth handshake and bridge setup

source: 云端中继
en: Cloud relay

source: 云端中继 · auth 握手完成 · 桥与订阅建立中
en: Cloud relay · auth handshake done · setting up bridge and subscriptions

source: 云端沙盒
en: Cloud sandbox

source: 云端沙盒 · ap-east-1
en: Cloud sandbox · ap-east-1

source: 云端沙盒在线 · 我的 Mac 在线
en: Cloud sandbox online · My Mac online

source: 云端沙盒执行端尚未接入会话
en: Cloud sandbox executor is not wired to conversations yet

source: 交换令牌
en: Exchange token

source: 交换成功但凭据落地失败 → 就地错误态，重试登录
en: Exchange succeeded but credentials failed to persist → error state, retry sign-in

source: 产物
en: Artifact

source: 产物 %lld
en: %lld artifacts

source: 仅图片可保存到相册
en: Only images can be saved to Photos

source: 仅失效账户层 tokenSet，连接功能与已保存服务器不受影响；重登走 O1 主按钮（重置一次性 state），不做静默续期
en: Only invalidates the account-level tokenSet; connections and saved servers are untouched. Re-login uses the primary button (fresh one-time state), no silent renewal

source: 仅存 Keychain
en: Keychain only

source: 仅显示前 20 个文件，更多变更请在桌面端查看
en: Showing first 20 files; view the rest on the desktop

source: 仅本次
en: Just once

source: 仅清除本机 Keychain 中的 OAuth tokenSet（账户层）；已保存的服务器与访问令牌不受影响。重新登录需再次走授权流程。
en: Only clears the local OAuth tokenSet (account layer); saved servers and access tokens are unaffected. Signing in again requires the authorization flow.

source: 仅清除绑定用户身份与 Bot 会话状态，不删除 Bot 配置；该用户需重新绑定后才能使用。
en: Only clears the bound user identity and bot session state; the bot configuration is kept. The user must bind again to use it.

source: 仅记录发送偏好 · 消息经当前连接的桌面端执行
en: Preference only · messages run on the currently connected desktop

source: 今天
en: Today

source: 从「添加服务器」扫码或手动输入添加
en: Add via Add Server (scan or manual entry)

source: 从任务看板下发任务，或直接新建一个会话
en: Dispatch tasks from the board, or start a new conversation

source: 从最后快照续跑中…
en: Resuming from last snapshot…

source: 从图库选择图片
en: Choose from photo library

source: 从文件 App 选择（PDF、文本等）
en: Choose from Files (PDF, text, etc.)

source: 从新建任务开始，Agent 将在云端沙盒中执行
en: Start with a new task; the agent runs in a cloud sandbox

source: 从桌面端删除该 Bot 配置与凭据，listBots 不再返回；不可恢复，请确认。
en: Deletes the bot configuration and credentials on the desktop; listBots no longer returns it. This cannot be undone.

source: 仓库
en: Repo

source: 代码评审
en: Code review

source: 令牌与安全
en: Token & security

source: 令牌交换失败
en: Token exchange failed

source: 令牌交换成功但凭据写入 Keychain 失败。请重试登录；若持续失败请检查系统存储设置。
en: Exchange succeeded but writing credentials to Keychain failed. Retry sign-in; if it persists, check system storage settings.

source: 令牌随桌面进程存活 · 删除将同时清除 Keychain 中的令牌 请仅在可信局域网使用 · wss:// 需自备反向代理
en: Token lives with the desktop process · deleting also removes it from Keychain\nUse on trusted LANs only · bring your own reverse proxy for wss://

source: 任务
en: Tasks

source: 任务在等待你的批准
en: A task is waiting for your approval

source: 任务失败
en: Task failed

source: 任务完成
en: Task completed

source: 任务完成 / 待审批 / 失败本地推送
en: Local notifications for completion / approvals / failures

source: 任务完成率
en: Task completion rate

source: 任务已发送 · 模式切换失败：%@
en: Task sent · mode switch failed: %@

source: 任务已被手动停止（exit code 130）
en: Task was stopped manually (exit code 130)

source: 任务拆解
en: Task breakdown

source: 会话
en: Chats

source: 会话分享
en: Shared chat

source: 会话数
en: Sessions

source: 会话配置
en: Session config

source: 传输安全
en: Transport security

source: 传输错误：%@
en: Transport error: %@

source: 低
en: Low

source: 作为引导补充注入当前回合
en: Injected into the current turn as guidance

source: 你取消了本次授权
en: You cancelled this authorization

source: 你在授权 Sheet 中取消了授权（✕ / 下拉抓手 / 页内「取消」等价），未产生 code 亦无 error 参数。重新登录即可再次发起，登录状态不受影响。
en: You cancelled the authorization in the sheet (✕ / swipe / in-page cancel are equivalent) — no code and no error parameter. Start again any time; your sign-in state is unaffected.

source: 使用 5 小时卡
en: Use 5-hour card

source: 使用 Z.ai 账号登录
en: Sign in with Z.ai

source: 使用中…
en: Using…

source: 使用周卡
en: Use weekly card

source: 使用相机拍摄一张图片
en: Take a photo with the camera

source: 供应商连接状态
en: Provider connection status

source: 供应商连接状态读取失败 · 下拉或稍后重进本页重试
en: Failed to read provider status · retry later or reopen this page

source: 保存
en: Save

source: 保存相册
en: Save to Photos

source: 保留单例兼容
en: Keep singleton compatibility

source: 修一个 bug
en: Fix a bug

source: 修复登录超时问题
en: Fix the login timeout issue

source: 修改
en: Edit

source: 修改 %@
en: Edit %@

source: 修改 sessions / tokens / events 三张表结构，约 120s，期间写入短暂排队。
en: Alters sessions/tokens/events schemas, ~120s; writes queue briefly.

source: 修改桌面设置 %@？
en: Edit desktop setting %@?

source: 偏好
en: preference

source: 偏好 Swift + SwiftUI 原生实现
en: Prefers native Swift + SwiftUI

source: 停止任务
en: Stop task

source: 停止该任务？
en: Stop this task?

source: 停用
en: Disabled

source: 先不提交
en: Not now

source: 先出计划，改动需经你确认
en: Drafts a plan first; changes need your approval

source: 先去连接桌面端
en: Connect desktop first

source: 先看完整 diff
en: Show full diff

source: 免鉴权
en: No auth

source: 免鉴权（--no-token）
en: No auth (--no-token)

source: 免鉴权（--no-token）· Keychain
en: No auth (--no-token) · Keychain

source: 免鉴权（--no-token）· 无过期，随桌面进程存活
en: No auth (--no-token) · no expiry, lives with the desktop process

source: 全文命中
en: Full-text match

source: 全部
en: All

source: 全部批准
en: Approve all

source: 全部项目
en: All projects

source: 共 %lld 个定时任务 · 由桌面端调度
en: %lld scheduled tasks · dispatched by the desktop

# 共 %lld 个通道 · %lld 个绑定上下文
source: 共 %1$lld 个通道 · %2$lld 个绑定上下文
en: %lld channels · %lld binding contexts

source: 关
en: Off

source: 关键操作待批准
en: Key operation awaiting approval

source: 关闭
en: Close

source: 关闭并重新发起
en: Close and restart

source: 其提供的工具将从桌面端 Agent 移除；可重新安装恢复。
en: Its tools will be removed from the desktop agent; reinstall to restore.

source: 内容不能为空
en: Content cannot be empty

source: 最近使用
en: Recents

source: 最近投递错误：%@
en: Last delivery error: %@

source: 最近运行
en: Recent run

source: 最近运行 · %@
en: Recent run · %@

source: 最长聊天时长
en: Max chat duration

source: 最长连续天数
en: Max consecutive days

source: 写一段功能
en: Write a feature

source: 凭据写入 Keychain
en: Credentials written to Keychain

source: 凭据写入 Keychain · tokenSet + userInfo
en: Credentials saved to Keychain · tokenSet + userInfo

source: 凭据写入失败
en: Failed to save credentials

source: 凭据摘要 · tokenSet
en: Credential summary · tokenSet

source: 凭据经桌面端代存（凭据存储），不落本机；保存后可用「测试连接」验证。
en: Credentials are stored on the desktop (credential store), not on this device; use Test Connection to verify.

source: 分享失败 · %@
en: Share failed · %@

source: 分享预览获取失败 · %@
en: Failed to load share preview · %@

source: 分享预览获取失败（HTTP %lld）· 链接可能已失效
en: Failed to load share preview (HTTP %lld) · the link may have expired

source: 分享预览解析失败 · 响应不是 JSON 对象
en: Share preview parse failed · response is not a JSON object

source: 分支由桌面端管理
en: Branch managed on desktop

source: 切换计划模式并发送任务：/plan 任务描述
en: Switch to plan mode and send a task: /plan task

source: 刚刚
en: Just now

source: 创建失败 · %@
en: Creation failed · %@

source: 删除 Bot
en: Delete Bot

source: 删除后桌面端 listBots 不再返回该 Bot；移除密钥仅清凭据并回未配置态，Bot 配置保留。
en: After deletion the desktop no longer returns this bot; removing the secret only clears the credential (unconfigured state) and keeps the bot configuration.

source: 删除服务器
en: Delete server

source: 删除此服务器
en: Delete this server

source: 删除该 Bot？
en: Delete this bot?

source: 刷新中…
en: Refreshing…

source: 刷新失败 · 桌面端未返回额度数据，请确认连接后重试
en: Refresh failed · no quota data from desktop; check the connection and retry

source: 刷新额度
en: Refresh quota

source: 剪贴板中没有云中继配对链接（桌面端 Web 远程控制 → 复制链接）
en: No relay pairing link in the clipboard (desktop Web Remote Control → copy link)

source: 剪贴板配对链接
en: Clipboard pairing link

source: 剩 %@
en: %@ left

source: 剩 %lld%%
en: %lld%% left

source: 剩余 %lld%%
en: %lld%% left

source: 剩余额度
en: Remaining quota

source: 加载中…
en: Loading…

source: 加载失败
en: Failed to load

source: 加载更早消息
en: Load earlier messages

source: 升级后重试
en: Upgrade and retry

source: 协作模式
en: Collaboration mode

source: 协议 · 鉴权
en: Protocol · auth

source: 协议抽取完成，diff 如上（+5 / -2）。还剩一个决定：旧调用方有 2 处仍直接持有 `SessionStore.shared`。
en: Protocol extraction done, diff above (+5 / -2). One decision left: 2 call sites still hold `SessionStore.shared` directly.

source: 协议抽取完成，迁移最后 2 处调用方中。
en: Protocol extraction done; migrating the last 2 call sites.

source: 协议握手 v4
en: Protocol handshake v4

source: 协议握手失败
en: Protocol handshake failed

source: 协议版本不匹配
en: Protocol version mismatch

source: 即 URL 中 token= 段；桌面端 --no-token 启动时留空即可（authRequired=false）。仅存 Keychain，掩码展示（末 4 位）
en: The token= segment of the URL; leave empty for --no-token desktops (authRequired=false). Stored in Keychain, masked (last 4 chars)

source: 即将支持
en: Coming soon

source: 卸载
en: Uninstall

source: 卸载插件
en: Uninstall plugin

source: 卸载插件 %@？
en: Uninstall plugin %@?

source: 历史版本的语言选项仅存储了偏好字符串、未接入任何文案切换逻辑（已移除）；本地化覆盖范围见版本说明。
en: Earlier language options only stored a preference string and were never wired to localization (now removed); see release notes for coverage.

source: 压缩
en: Compact

source: 压缩上下文？
en: Compact context?

source: 压缩中…
en: Compacting…

source: 压缩会话上下文
en: Compact conversation context

source: 压缩完成
en: Compaction finished

source: 压缩完成 · 上下文已释放
en: Compaction finished · context freed

source: 原配置重试
en: Retry with saved config

source: 去审批
en: Review

source: 去系统设置开启
en: Enable in Settings

source: 参数
en: Arguments

source: 参数定义不可用
en: Argument definitions unavailable

source: 反馈工单
en: Feedback ticket

source: 发现服务
en: Discover service

source: 发送
en: Send

source: 发送水位回落（<256KB）· 恢复发送
en: Send backlog drained (<256KB) · resuming

source: 发送消息…
en: Send a message…

source: 发送第一条消息，开始与桌面端的对话
en: Send the first message to start the conversation with the desktop

source: 发送饱和（未 ack >1MB）· 暂停发送
en: Send saturated (>1MB unacked) · pausing

source: 取消
en: Cancel

source: 取消归档
en: Unarchive

source: 取消登录
en: Cancel sign-in

source: 取消置顶
en: Unpin

source: 取消连接
en: Cancel connection

source: 变更前确认
en: Ask before changes

source: 只批准这一条命令
en: Approve this command only

source: 只读分享
en: Read-only share

source: 可安装
en: Installable

source: 可恢复
en: Resumable

source: 可用
en: Available

# 可用：5 小时卡 ×%lld · 周卡 ×%lld
source: 可用：5 小时卡 ×%1$lld · 周卡 ×%2$lld
en: Available: %lld 5-hour · %lld weekly

source: 可粘贴完整链接（http/https/ws/wss）或云中继配对链接（https://…/remote/v4?…）；端口默认 3030，仅输 host:port 时补 http://
en: Paste a full link (http/https/ws/wss) or a relay pairing link (https://…/remote/v4?…); default port 3030, http:// is added for bare host:port

source: 同一局域网？zcode --web 运行中？本地网络权限已允许（被拒时请求静默失败）→ 重试
en: Same network? zcode --web running? Local Network permission granted (denied requests fail silently) → retry

source: 同任务同类命令不再询问
en: Don't ask again for similar commands in this task

source: 同步 IO 改 async/await
en: Convert sync IO to async/await

source: 同步镜像仓库
en: Sync mirror repo

source: 同类命令全部放行
en: Allow all similar commands

source: 后台 Bash
en: Background shell

source: 后续请求携带 Authorization: Bearer {accessToken}（conversationSharePreviewClient.ts:145，转引）
en: Follow-up requests carry Authorization: Bearer {accessToken} (conversationSharePreviewClient.ts:145, cited)

source: 启动
en: Start

source: 启动「%@」
en: Start %@

source: 启动中…
en: Starting…

source: 启用
en: Enabled

source: 周卡
en: Weekly reset card

source: 周报生成
en: Weekly report

source: 周末镜像同步
en: Weekend mirror sync

source: 命令未送达（连接中断或不在连接态）
en: Command not delivered (connection lost or not connected)

source: 命令详情以桌面端交互卡为准（待审批对象：%@）
en: See the desktop interaction card for command details (pending approval: %@)

source: 响应不是 JSON
en: Response is not JSON

source: 响应缺少 data.token
en: Response missing data.token

source: 回合进行中发送将排队，回合结束后自动投递（桌面默认）
en: Messages sent mid-turn queue and deliver after the turn (desktop default)

source: 回复粒度
en: Reply granularity
